<a href="https://colab.research.google.com/github/Juanisazalu/ANALITICA-3/blob/main/Explotaci%C3%B3n_Datos.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [6]:
import pandas as pd
import numpy as np
import sqlite3 as sql #### para bases de datos sql
import a_funciones as funciones  ###archivo de funciones propias
encuesta_empleado=pd.read_csv("data\employee_survey_data.csv")
general_data=pd.read_csv("data\general_data.csv")
encuesta_gerente=pd.read_csv("data\manager_survey.csv")
info_retiros=pd.read_csv("data/retirement_info.csv")
encuesta_empleado.drop("Unnamed: 0", axis=1, inplace=True)
general_data.drop("Unnamed: 0", axis=1, inplace=True)
encuesta_gerente.drop("Unnamed: 0", axis=1, inplace=True)
info_retiros.drop("Unnamed: 0.1", axis=1, inplace=True)
info_retiros.drop("Unnamed: 0", axis=1, inplace=True)

In [15]:
encuesta_empleado.sort_values(by=['EmployeeID'],ascending=1).head(100)

,EmployeeID,EnvironmentSatisfaction,JobSatisfaction,WorkLifeBalance,DateSurvey
0,1,3.0,4.0,2.0,2015-12-31
4410,1,3.0,4.0,2.0,2016-12-31
4411,2,3.0,2.0,4.0,2016-12-31
1,2,3.0,2.0,4.0,2015-12-31
2,3,2.0,2.0,1.0,2015-12-31
...,...,...,...,...,...
47,48,2.0,2.0,3.0,2015-12-31
4458,49,4.0,3.0,2.0,2016-12-31
48,49,4.0,3.0,2.0,2015-12-31
4459,50,1.0,2.0,3.0,2016-12-31
49,50,1.0,2.0,3.0,2015-12-31

In [16]:
general_data.sort_values(by=['EmployeeID'],ascending=1).head(100)

,Age,BusinessTravel,Department,DistanceFromHome,Education,EducationField,EmployeeCount,EmployeeID,Gender,JobLevel,...,Over18,PercentSalaryHike,StandardHours,StockOptionLevel,TotalWorkingYears,TrainingTimesLastYear,YearsAtCompany,YearsSinceLastPromotion,YearsWithCurrManager,InfoDate
0,51,Travel_Rarely,Sales,6,2,Life Sciences,1,1,Female,1,...,Y,11,8,0,1.0,6,1,0,0,2015-12-31
4410,51,Travel_Rarely,Sales,6,2,Life Sciences,1,1,Female,1,...,Y,11,8,0,1.0,6,1,0,0,2016-12-31
4411,31,Travel_Frequently,Research & Development,10,1,Life Sciences,1,2,Female,1,...,Y,23,8,1,6.0,3,5,1,4,2016-12-31
1,31,Travel_Frequently,Research & Development,10,1,Life Sciences,1,2,Female,1,...,Y,23,8,1,6.0,3,5,1,4,2015-12-31
2,32,Travel_Frequently,Research & Development,17,4,Other,1,3,Male,4,...,Y,15,8,3,5.0,2,5,0,3,2015-12-31
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
47,36,Non-Travel,Research & Development,5,4,Life Sciences,1,48,Male,1,...,Y,21,8,0,11.0,4,9,0,8,2015-12-31
4458,32,Travel_Rarely,Sales,2,3,Marketing,1,49,Male,2,...,Y,21,8,1,13.0,4,13,4,8,2016-12-31
48,32,Travel_Rarely,Sales,2,3,Marketing,1,49,Male,2,...,Y,21,8,1,13.0,4,13,4,8,2015-12-31
4459,38,Travel_Rarely,Research & Development,5,2,Life Sciences,1,50,Female,3,...,Y,19,8,2,19.0,4,10,0,1,2016-12-31
49,38,Travel_Rarely,Research & Development,5,2,Life Sciences,1,50,Female,3,...,Y,19,8,2,19.0,4,10,0,1,2015-12-31

In [18]:
encuesta_gerente.sort_values(by=['EmployeeID'],ascending=1).head(100)

      EmployeeID  JobInvolvement  PerformanceRating  SurveyDate
0              1               3                  3  2015-12-31
4410           1               3                  3  2016-12-31
4411           2               2                  4  2016-12-31
1              2               2                  4  2015-12-31
2              3               3                  3  2015-12-31
...          ...             ...                ...         ...
47            48               3                  4  2015-12-31
4458          49               3                  4  2016-12-31
48            49               3                  4  2015-12-31
4459          50               2                  3  2016-12-31
49            50               2                  3  2015-12-31

[100 rows x 4 columns]

In [20]:
info_retiros.sort_values(by=['EmployeeID'],ascending=1).head(100)

    EmployeeID Attrition retirementDate retirementType resignationReason
0            2       Yes     2016-10-15    Resignation            Others
1            7       Yes     2016-07-20    Resignation            Stress
2           14       Yes     2016-11-08    Resignation            Others
3           29       Yes     2016-10-15    Resignation            Others
4           31       Yes     2016-02-08    Resignation            Salary
..         ...       ...            ...            ...               ...
95         544       Yes     2016-07-31    Resignation            Others
96         556       Yes     2016-05-27    Resignation            Others
97         571       Yes     2016-04-06    Resignation            Others
98         572       Yes     2016-04-27    Resignation            Others
99         574       Yes     2016-08-23    Resignation            Others

[100 rows x 5 columns]

In [7]:
encuesta_empleado.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8820 entries, 0 to 8819
Data columns (total 5 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   EmployeeID               8820 non-null   int64
 1   EnvironmentSatisfaction  8770 non-null   float64
 2   JobSatisfaction          8780 non-null   float64
 3   WorkLifeBalance          8744 non-null   float64
 4   DateSurvey               8820 non-null   object
dtypes: float64(3), int64(1), object(1)
memory usage: 344.7+ KB

In [8]:
general_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8820 entries, 0 to 8819
Data columns (total 24 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   Age                      8820 non-null   int64
 1   BusinessTravel           8820 non-null   object
 2   Department               8820 non-null   object
 3   DistanceFromHome         8820 non-null   int64
 4   Education                8820 non-null   int64
 5   EducationField           8820 non-null   object
 6   EmployeeCount            8820 non-null   int64
 7   EmployeeID               8820 non-null   int64
 8   Gender                   8820 non-null   object
 9   JobLevel                 8820 non-null   int64
 10  JobRole                  8820 non-null   object
 11  MaritalStatus            8820 non-null   object
 12  MonthlyIncome            8820 non-null   int64
 13  NumCompaniesWorked       8782 non-null   float64
 14  Over18                   8820 non-null   object
 15  PercentSalaryHike        8820 non-null   int64
 16  StandardHours            8820 non-null   int64
 17  StockOptionLevel         8820 non-null   int64
 18  TotalWorkingYears        8802 non-null   float64
 19  TrainingTimesLastYear    8820 non-null   int64
 20  YearsAtCompany           8820 non-null   int64
 21  YearsSinceLastPromotion  8820 non-null   int64
 22  YearsWithCurrManager     8820 non-null   int64
 23  InfoDate                 8820 non-null   object
dtypes: float64(2), int64(14), object(8)
memory usage: 1.6+ MB

In [9]:
encuesta_gerente.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8820 entries, 0 to 8819
Data columns (total 4 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   EmployeeID         8820 non-null   int64
 1   JobInvolvement     8820 non-null   int64
 2   PerformanceRating  8820 non-null   int64
 3   SurveyDate         8820 non-null   object
dtypes: int64(3), object(1)
memory usage: 275.8+ KB

In [10]:
info_retiros.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 711 entries, 0 to 710
Data columns (total 5 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   EmployeeID         711 non-null    int64
 1   Attrition          711 non-null    object
 2   retirementDate     711 non-null    object
 3   retirementType     711 non-null    object
 4   resignationReason  641 non-null    object
dtypes: int64(1), object(4)
memory usage: 27.9+ KB